import { memo } from "react";

/**
 * Fonction qui permet d'afficher l'icone de la clé admin.
 *
 * @return {React.JSX.Element} Code JSX du svg souhaité.
 */
export const AdminKey = memo(({ width, height }: { width: number, height: number }) => {
    return (
    <svg width={width} height={height} viewBox="0 0 800 800" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path d="M522.69 486.23C639.027 486.23 733.333 392.307 733.333 276.448C733.333 160.589 639.027 66.6667 522.69 66.6667C406.357 66.6667 312.05 160.589 312.05 276.448C312.05 330.113 336.543 369.143 336.543 369.143L81.8136 622.83C70.3833 634.213 54.381 663.81 81.8136 691.13L111.205 720.403C122.635 730.16 151.373 743.82 174.887 720.403L209.177 686.253C243.468 720.403 282.657 700.89 297.353 681.373C321.846 647.223 292.454 613.073 292.454 613.073L302.251 603.317C349.277 650.15 390.427 622.83 405.123 603.317C429.617 569.167 405.123 535.017 405.123 535.017C395.327 515.5 375.733 515.5 400.223 491.11L429.617 461.837C453.13 481.35 501.463 486.23 522.69 486.23Z" stroke="var(--titre-color)" strokeWidth="50" strokeLinejoin="round"/>
        <path d="M596.177 276.451C596.177 316.867 563.28 349.63 522.7 349.63C482.117 349.63 449.22 316.867 449.22 276.451C449.22 236.035 482.117 203.271 522.7 203.271C563.28 203.271 596.177 236.035 596.177 276.451Z" stroke="var(--titre-color)" strokeWidth="50"/>
    </svg>
    )
});
AdminKey.displayName = 'AdminKey';